package synway.module_publicaccount.public_chat;

/**
 * @author XuKaiyin
 * @class synway.module_publicaccount.public_chat
 * @name
 * @describe
 * @time 2018/11/12 15:27
 */
public class TestJson {
    private String json ="{\"MSG\":{\"MSG_TYPE\":4,\"MSG_GUID\":\"\",\"MSG_POSITION\":1,\"MSG_INFO\":{\"TITLE_SIZE\":0,\"TITLE_URL\":\"\",\"TITLE_URL_NAME\":\"\",\"TITLE_URL_W\":600,\"TITLE_URL_TYPE\":1,\"TITLE_URL_H\":500,\"TITLE\":\"重点人分级分类统计\",\"TITLE_POSITION\":0,\"DATALINE\":[{\"DATATYPE\":1,\"DATA\":{\"TEXT\":[{\"URL_W\":600,\"COLOR\":\"#000000\",\"SIZE\":1,\"URL_NAME\":\"\",\"CONTENT\":\"查询时间：2018-12-10 15:13:03\",\"URL_H\":500,\"URL\":\"\",\"URL_TYPE\":1}]}},{\"DATATYPE\":1,\"DATA\":{\"TEXT\":[{\"URL_W\":600,\"COLOR\":\"#000000\",\"SIZE\":1,\"URL_NAME\":\"\",\"CONTENT\":\"支队数量：14\",\"URL_H\":500,\"URL\":\"\",\"URL_TYPE\":1}]}},{\"DATATYPE\":1,\"DATA\":{\"TEXT\":[{\"URL_W\":600,\"COLOR\":\"#000000\",\"SIZE\":1,\"URL_NAME\":\"\",\"CONTENT\":\"种类数量：34\",\"URL_H\":500,\"URL\":\"\",\"URL_TYPE\":1}]}},{\"DATATYPE\":6,\"DATA\":{\"EXTEND_CONTENT\":\"{\\\"condition\\\":{\\\"organIds\\\":[242,243,244,245,246,247,248,249,250,251,29,25,221,241],\\\"types\\\":[{\\\"parent\\\":\\\"利益诉求\\\",\\\"children\\\":[\\\"\\\\\\\"失独\\\\\\\"群体\\\",\\\"\\\\\\\"民代幼\\\\\\\"维权群体\\\",\\\"\\\\\\\"涉众\\\\\\\"经济案件\\\",\\\"个访类\\\",\\\"企业下岗人员集体维权\\\",\\\"其它\\\",\\\"农村基层选举维权群体\\\",\\\"出租车群体\\\",\\\"拆迁上访维权\\\",\\\"涉军维权类\\\",\\\"涉法涉诉类\\\",\\\"环保引发群体纠纷\\\",\\\"非津籍考生家长\\\"]},{\\\"parent\\\":\\\"反分裂\\\",\\\"children\\\":[\\\"涉港、澳、台\\\",\\\"涉疆、涉恐\\\",\\\"涉藏、涉蒙\\\"]},{\\\"parent\\\":\\\"境外使领馆、境内外NGO组织\\\",\\\"children\\\":[\\\"其它\\\",\\\"国内民间组织\\\",\\\"境外NGO\\\",\\\"境外使领馆\\\"]},{\\\"parent\\\":\\\"意识形态、颠覆渗透\\\",\\\"children\\\":[\\\"\\\\\\\"左\\\\\\\"\\\\\\\"右\\\\\\\"思想领域\\\",\\\"不法律师群体\\\",\\\"其它\\\",\\\"境外媒体\\\",\\\"民运重点人\\\"]},{\\\"parent\\\":\\\"邪教和非法宗教\\\",\\\"children\\\":[\\\"其它\\\",\\\"呼喊派\\\",\\\"善人道\\\",\\\"地下天主教\\\",\\\"基督教家庭教会\\\",\\\"实际神\\\",\\\"法轮功\\\",\\\"藏传佛教\\\",\\\"门徒会\\\"]}],\\\"cityCodes\\\":[\\\"330100\\\"]},\\\"time\\\":{\\\"week\\\":0,\\\"hour\\\":0,\\\"day\\\":1544371200}}\",\"COLOR\":\"#000000\",\"SIZE\":1,\"URL_NAME\":\"在杭重点人员详情\",\"CONTENT\":\"目标当天在杭数量：0\",\"URL\":\"/FTPText/weexResource/yj_detail.js\",\"URL_TYPE\":1}},{\"DATATYPE\":6,\"DATA\":{\"EXTEND_CONTENT\":\"{\\\"condition\\\":{\\\"organIds\\\":[242,243,244,245,246,247,248,249,250,251,29,25,221,241],\\\"types\\\":[{\\\"parent\\\":\\\"利益诉求\\\",\\\"children\\\":[\\\"\\\\\\\"失独\\\\\\\"群体\\\",\\\"\\\\\\\"民代幼\\\\\\\"维权群体\\\",\\\"\\\\\\\"涉众\\\\\\\"经济案件\\\",\\\"个访类\\\",\\\"企业下岗人员集体维权\\\",\\\"其它\\\",\\\"农村基层选举维权群体\\\",\\\"出租车群体\\\",\\\"拆迁上访维权\\\",\\\"涉军维权类\\\",\\\"涉法涉诉类\\\",\\\"环保引发群体纠纷\\\",\\\"非津籍考生家长\\\"]},{\\\"parent\\\":\\\"反分裂\\\",\\\"children\\\":[\\\"涉港、澳、台\\\",\\\"涉疆、涉恐\\\",\\\"涉藏、涉蒙\\\"]},{\\\"parent\\\":\\\"境外使领馆、境内外NGO组织\\\",\\\"children\\\":[\\\"其它\\\",\\\"国内民间组织\\\",\\\"境外NGO\\\",\\\"境外使领馆\\\"]},{\\\"parent\\\":\\\"意识形态、颠覆渗透\\\",\\\"children\\\":[\\\"\\\\\\\"左\\\\\\\"\\\\\\\"右\\\\\\\"思想领域\\\",\\\"不法律师群体\\\",\\\"其它\\\",\\\"境外媒体\\\",\\\"民运重点人\\\"]},{\\\"parent\\\":\\\"邪教和非法宗教\\\",\\\"children\\\":[\\\"其它\\\",\\\"呼喊派\\\",\\\"善人道\\\",\\\"地下天主教\\\",\\\"基督教家庭教会\\\",\\\"实际神\\\",\\\"法轮功\\\",\\\"藏传佛教\\\",\\\"门徒会\\\"]}],\\\"cityCodes\\\":[\\\"330100,330700,331100,330800,330600,330200,330900,331000,330300,330400,330500\\\"]},\\\"time\\\":{\\\"week\\\":0,\\\"hour\\\":0,\\\"day\\\":1544371200}}\",\"COLOR\":\"#000000\",\"SIZE\":1,\"URL_NAME\":\"在浙重点人员详情\",\"CONTENT\":\"目标当天在浙数量：0\",\"URL\":\"/FTPText/weexResource/yj_detail.js\",\"URL_TYPE\":1}},{\"DATATYPE\":6,\"DATA\":{\"EXTEND_CONTENT\":\"{\\\"condition\\\":{\\\"organIds\\\":[242,243,244,245,246,247,248,249,250,251,29,25,221,241],\\\"types\\\":[{\\\"parent\\\":\\\"利益诉求\\\",\\\"children\\\":[\\\"\\\\\\\"失独\\\\\\\"群体\\\",\\\"\\\\\\\"民代幼\\\\\\\"维权群体\\\",\\\"\\\\\\\"涉众\\\\\\\"经济案件\\\",\\\"个访类\\\",\\\"企业下岗人员集体维权\\\",\\\"其它\\\",\\\"农村基层选举维权群体\\\",\\\"出租车群体\\\",\\\"拆迁上访维权\\\",\\\"涉军维权类\\\",\\\"涉法涉诉类\\\",\\\"环保引发群体纠纷\\\",\\\"非津籍考生家长\\\"]},{\\\"parent\\\":\\\"反分裂\\\",\\\"children\\\":[\\\"涉港、澳、台\\\",\\\"涉疆、涉恐\\\",\\\"涉藏、涉蒙\\\"]},{\\\"parent\\\":\\\"境外使领馆、境内外NGO组织\\\",\\\"children\\\":[\\\"其它\\\",\\\"国内民间组织\\\",\\\"境外NGO\\\",\\\"境外使领馆\\\"]},{\\\"parent\\\":\\\"意识形态、颠覆渗透\\\",\\\"children\\\":[\\\"\\\\\\\"左\\\\\\\"\\\\\\\"右\\\\\\\"思想领域\\\",\\\"不法律师群体\\\",\\\"其它\\\",\\\"境外媒体\\\",\\\"民运重点人\\\"]},{\\\"parent\\\":\\\"邪教和非法宗教\\\",\\\"children\\\":[\\\"其它\\\",\\\"呼喊派\\\",\\\"善人道\\\",\\\"地下天主教\\\",\\\"基督教家庭教会\\\",\\\"实际神\\\",\\\"法轮功\\\",\\\"藏传佛教\\\",\\\"门徒会\\\"]}],\\\"cityCodes\\\":[\\\"110000\\\"]},\\\"time\\\":{\\\"week\\\":0,\\\"hour\\\":0,\\\"day\\\":1544371200}}\",\"COLOR\":\"#000000\",\"SIZE\":1,\"URL_NAME\":\"在京重点人员详情\",\"CONTENT\":\"目标当天在京数量：0\",\"URL\":\"/FTPText/weexResource/yj_detail.js\",\"URL_TYPE\":1}},{\"DATATYPE\":6,\"DATA\":{\"EXTEND_CONTENT\":\"c8218766-2f51-43f9-9d39-dfdd47dbeec4\",\"COLOR\":\"#000000\",\"SIZE\":1,\"URL_NAME\":\"\",\"CONTENT\":\"点击查看详细信息\",\"URL\":\"\",\"URL_TYPE\":1}}]}},\"TO_USER\":[\"0571_2\"],\"SEND_TYPE\":2,\"GUID\":\"8e5fbc6d-4456-4ac0-b3a9-1b086ff64666 \",\"FC_BT_GUID\":\"\",\"TIME\":\"2018-12-10 15:13:03\"}";
    public String getJson() {
        return json;
    }

    public void setJson(String json) {
        this.json = json;
    }

    private String jsonChart = "{ \"GUID\": \"8e5fbc6d-4456-4ac0-b3a9-1b086ff64666\", \"TIME\": " +
            "\"2018-10-26 14:25:34\", \"TO_USER\": \"ME\", \"MSG\": { \"MSG_TYPE\": 7, " +
            "\"MSG_INFO\": { \"DATALINE\": [ { \"DATATYPE\": 7, \"CONTENT\": \"查询时间：      " +

            "2018-10-26 14:25:34\" }, { \"DATATYPE\": 7, \"CONTENT\": \"支队数量：     6个\" }," +
            " { " +
            "\"DATATYPE\": 7, \"CONTENT\": \"种类数量：    20种\" }, { \"DATATYPE\": 7, " +
            "\"CONTENT\": \"目标在杭数量：    30个\" }, { \"DATATYPE\": 7, \"CONTENT\": \"目标在杭数量：    " +
            "40个\" }, { \"DATATYPE\": 7, \"CONTENT\": \"目标进京数量：    20个\" } ], \"TITLE\": " +
            "\"预警查询\", \"DATALIST\": [ { \"address\": \"浙江\", \"data\": [ { \"hour\": [ { " +
            "\"organId\": 1, \"organName\": \"杭州支队\", \"items\": [ { \"count\": 19, \"data\":" +
            " \"00:00\" }, { \"count\": 38, \"data\": \"01:00\" }, { \"count\": 24, \"data\":" +
            " \"02:00\" }, { \"count\": 25, \"data\": \"03:00\" }, { \"count\": 12, \"data\":" +
            " \"04:00\" }, { \"count\": 10, \"data\": \"05:00\" }, { \"count\": 42, \"data\":" +
            " \"06:00\" }, { \"count\": 53, \"data\": \"07:00\" }, { \"count\": 20, \"data\":" +
            " \"08:00\" }, { \"count\": 30, \"data\": \"09:00\" }, { \"count\": 50, \"data\":" +
            " \"10:00\" }, { \"count\": 9, \"data\": \"11:00\" }, { \"count\": 47, \"data\": " +
            "\"12:00\" }, { \"count\": 9, \"data\": \"13:00\" }, { \"count\": 13, \"data\": " +
            "\"14:00\" }, { \"count\": 10, \"data\": \"15:00\" }, { \"count\": 12, \"data\": " +
            "\"16:00\" }, { \"count\": 13, \"data\": \"17:00\" }, { \"count\": 10, \"data\": " +
            "\"18:00\" }, { \"count\": 10, \"data\": \"19:00\" }, { \"count\": 12, \"data\": " +
            "\"20:00\" }, { \"count\": 22, \"data\": \"21:00\" }, { \"count\": 43, \"data\": " +
            "\"22:00\" }, { \"count\": 44, \"data\": \"23:00\" } ] }, { \"organId\": 2, " +
            "\"organName\": \"开发机构\", \"items\": [ { \"count\": 11, \"data\": \"00:00\" }, { " +
            "\"count\": 18, \"data\": \"01:00\" }, { \"count\": 0, \"data\": \"02:00\" }, { " +
            "\"count\": 10, \"data\": \"03:00\" }, { \"count\": 2, \"data\": \"04:00\" }, { " +
            "\"count\": 30, \"data\": \"05:00\" }, { \"count\": 10, \"data\": \"06:00\" }, { " +
            "\"count\": 3, \"data\": \"07:00\" }, { \"count\": 2, \"data\": \"08:00\" }, { " +
            "\"count\": 24, \"data\": \"09:00\" }, { \"count\": 26, \"data\": \"10:00\" }, { " +
            "\"count\": 17, \"data\": \"11:00\" }, { \"count\": 5, \"data\": \"12:00\" }, { " +
            "\"count\": 43, \"data\": \"13:00\" }, { \"count\": 33, \"data\": \"14:00\" }, { " +
            "\"count\": 28, \"data\": \"15:00\" }, { \"count\": 2, \"data\": \"16:00\" }, { " +
            "\"count\": 1, \"data\": \"17:00\" }, { \"count\": 2, \"data\": \"18:00\" }, { " +
            "\"count\": 4, \"data\": \"19:00\" }, { \"count\": 22, \"data\": \"20:00\" }, { " +
            "\"count\": 1, \"data\": \"21:00\" }, { \"count\": 0, \"data\": \"22:00\" }, { " +
            "\"count\": 4, \"data\": \"23:00\" } ] } ], \"day\": [ { \"organId\": 1, " +
            "\"organName\": \"杭州支队\", \"items\": [ { \"count\": 120, \"data\": \"10月1日\" }, {" +
            " \"count\": 12, \"data\": \"10月2日\" }, { \"count\": 10, \"data\": \"10月3日\" }, {" +
            " \"count\": 132, \"data\": \"10月4日\" }, { \"count\": 12, \"data\": \"10月5日\" }, " +
            "{ \"count\": 12, \"data\": \"10月6日\" }, { \"count\": 20, \"data\": \"10月7日\" }, " +
            "{ \"count\": 32, \"data\": \"10月8日\" }, { \"count\": 10, \"data\": \"10月9日\" }, " +
            "{ \"count\": 132, \"data\": \"10月10日\" }, { \"count\": 44, \"data\": \"10月11日\" " +
            "}, { \"count\": 63, \"data\": \"10月12日\" }, { \"count\": 120, \"data\": " +
            "\"10月13日\" }, { \"count\": 132, \"data\": \"10月14日\" }, { \"count\": 10, " +
            "\"data\": \"10月15日\" }, { \"count\": 182, \"data\": \"10月16日\" }, { \"count\": " +
            "1, \"data\": \"10月17日\" }, { \"count\": 103, \"data\": \"10月18日\" }, { " +
            "\"count\": 120, \"data\": \"10月19日\" }, { \"count\": 132, \"data\": \"10月20日\" " +
            "}, { \"count\": 130, \"data\": \"10月21日\" }, { \"count\": 52, \"data\": " +
            "\"10月22日\" }, { \"count\": 19, \"data\": \"10月23日\" }, { \"count\": 53, " +
            "\"data\": \"10月24日\" }, { \"count\": 90, \"data\": \"10月25日\" }, { \"count\": " +
            "42, \"data\": \"10月26日\" }, { \"count\": 130, \"data\": \"10月27日\" }, { " +
            "\"count\": 2, \"data\": \"10月28日\" }, { \"count\": 0, \"data\": \"10月29日\" }, { " +
            "\"count\": 43, \"data\": \"10月30日\" } ] }, { \"organId\": 2, \"organName\": " +
            "\"开发机构\", \"items\": [ { \"count\": 120, \"data\": \"10月1日\" }, { \"count\": 12," +
            " \"data\": \"10月2日\" }, { \"count\": 10, \"data\": \"10月3日\" }, { \"count\": " +
            "132, \"data\": \"10月4日\" }, { \"count\": 12, \"data\": \"10月5日\" }, { \"count\":" +
            " 12, \"data\": \"10月6日\" }, { \"count\": 20, \"data\": \"10月7日\" }, { \"count\":" +
            " 32, \"data\": \"10月8日\" }, { \"count\": 10, \"data\": \"10月9日\" }, { \"count\":" +
            " 132, \"data\": \"10月10日\" }, { \"count\": 44, \"data\": \"10月11日\" }, { " +
            "\"count\": 63, \"data\": \"10月12日\" }, { \"count\": 120, \"data\": \"10月13日\" }," +
            " { \"count\": 132, \"data\": \"10月14日\" }, { \"count\": 10, \"data\": \"10月15日\"" +
            " }, { \"count\": 182, \"data\": \"10月16日\" }, { \"count\": 130, \"data\": " +
            "\"10月17日\" }, { \"count\": 133, \"data\": \"10月18日\" }, { \"count\": 100, " +
            "\"data\": \"10月19日\" }, { \"count\": 112, \"data\": \"10月20日\" }, { \"count\": " +
            "120, \"data\": \"10月21日\" }, { \"count\": 52, \"data\": \"10月22日\" }, { " +
            "\"count\": 119, \"data\": \"10月23日\" }, { \"count\": 253, \"data\": \"10月24日\" " +
            "}, { \"count\": 90, \"data\": \"10月25日\" }, { \"count\": 10, \"data\": " +
            "\"10月26日\" }, { \"count\": 130, \"data\": \"10月27日\" }, { \"count\": 2, " +
            "\"data\": \"10月28日\" }, { \"count\": 0, \"data\": \"10月29日\" }, { \"count\": 0, " +
            "\"data\": \"10月30日\" } ] } ], \"week\": [ { \"organId\": 1, \"organName\": " +
            "\"杭州支队\", \"items\": [ { \"count\": 120, \"data\": \"2018年第42周\" }, { \"count\":" +
            " 300, \"data\": \"2018年第43周\" }, { \"count\": 30, \"data\": \"2018年第44周\" }, { " +
            "\"count\": 400, \"data\": \"2018年第45周\" } ] }, { \"organId\": 2, \"organName\": " +
            "\"开发机构\", \"items\": [ { \"count\": 120, \"data\": \"2018年第42周\" }, { \"count\":" +
            " 300, \"data\": \"2018年第43周\" }, { \"count\": 30, \"data\": \"2018年第44周\" }, { " +
            "\"count\": 400, \"data\": \"2018年第45周\" } ] } ] } ] }, { \"address\": \"北京\", " +
            "\"data\": [ { \"hour\": [ { \"organId\": 11, \"organName\": \"北京支队\", \"items\":" +
            " [ { \"count\": 1, \"data\": \"00:00\" }, { \"count\": 3, \"data\": \"01:00\" }," +
            " { \"count\": 26, \"data\": \"02:00\" }, { \"count\": 25, \"data\": \"03:00\" }," +
            " { \"count\": 12, \"data\": \"04:00\" }, { \"count\": 10, \"data\": \"05:00\" }," +
            " { \"count\": 42, \"data\": \"06:00\" }, { \"count\": 13, \"data\": \"07:00\" }," +
            " { \"count\": 30, \"data\": \"08:00\" }, { \"count\": 30, \"data\": \"09:00\" }," +
            " { \"count\": 50, \"data\": \"10:00\" }, { \"count\": 19, \"data\": \"11:00\" }," +
            " { \"count\": 47, \"data\": \"12:00\" }, { \"count\": 9, \"data\": \"13:00\" }, " +
            "{ \"count\": 13, \"data\": \"14:00\" }, { \"count\": 10, \"data\": \"15:00\" }, " +
            "{ \"count\": 12, \"data\": \"16:00\" }, { \"count\": 13, \"data\": \"17:00\" }, " +
            "{ \"count\": 0, \"data\": \"18:00\" }, { \"count\": 6, \"data\": \"19:00\" }, { " +
            "\"count\": 12, \"data\": \"20:00\" }, { \"count\": 22, \"data\": \"21:00\" }, { " +
            "\"count\": 43, \"data\": \"22:00\" }, { \"count\": 44, \"data\": \"23:00\" } ] " +
            "}, { \"organId\": 22, \"organName\": \"北京开发机构\", \"items\": [ { \"count\": 19, " +
            "\"data\": \"00:00\" }, { \"count\": 38, \"data\": \"01:00\" }, { \"count\": 24, " +
            "\"data\": \"02:00\" }, { \"count\": 25, \"data\": \"03:00\" }, { \"count\": 12, " +
            "\"data\": \"04:00\" }, { \"count\": 10, \"data\": \"05:00\" }, { \"count\": 4, " +
            "\"data\": \"06:00\" }, { \"count\": 13, \"data\": \"07:00\" }, { \"count\": 4, " +
            "\"data\": \"08:00\" }, { \"count\": 3, \"data\": \"09:00\" }, { \"count\": 5, " +
            "\"data\": \"10:00\" }, { \"count\": 9, \"data\": \"11:00\" }, { \"count\": 7, " +
            "\"data\": \"12:00\" }, { \"count\": 39, \"data\": \"13:00\" }, { \"count\": 13, " +
            "\"data\": \"14:00\" }, { \"count\": 0, \"data\": \"15:00\" }, { \"count\": 48, " +
            "\"data\": \"16:00\" }, { \"count\": 33, \"data\": \"17:00\" }, { \"count\": 60, " +
            "\"data\": \"18:00\" }, { \"count\": 50, \"data\": \"19:00\" }, { \"count\": 62, " +
            "\"data\": \"20:00\" }, { \"count\": 62, \"data\": \"21:00\" }, { \"count\": 24, " +
            "\"data\": \"22:00\" }, { \"count\": 34, \"data\": \"23:00\" } ] } ], \"day\": [ " +
            "{ \"organId\": 11, \"organName\": \"北京支队\", \"items\": [ { \"count\": 120, " +
            "\"data\": \"10月1日\" }, { \"count\": 12, \"data\": \"10月2日\" }, { \"count\": 10, " +
            "\"data\": \"10月3日\" }, { \"count\": 132, \"data\": \"10月4日\" }, { \"count\": 12," +
            " \"data\": \"10月5日\" }, { \"count\": 12, \"data\": \"10月6日\" }, { \"count\": 20," +
            " \"data\": \"10月7日\" }, { \"count\": 32, \"data\": \"10月8日\" }, { \"count\": 10," +
            " \"data\": \"10月9日\" }, { \"count\": 132, \"data\": \"10月10日\" }, { \"count\": " +
            "44, \"data\": \"10月11日\" }, { \"count\": 63, \"data\": \"10月12日\" }, { " +
            "\"count\": 120, \"data\": \"10月13日\" }, { \"count\": 132, \"data\": \"10月14日\" " +
            "}, { \"count\": 120, \"data\": \"10月15日\" }, { \"count\": 182, \"data\": " +
            "\"10月16日\" }, { \"count\": 143, \"data\": \"10月17日\" }, { \"count\": 103, " +
            "\"data\": \"10月18日\" }, { \"count\": 120, \"data\": \"10月19日\" }, { \"count\": " +
            "132, \"data\": \"10月20日\" }, { \"count\": 130, \"data\": \"10月21日\" }, { " +
            "\"count\": 52, \"data\": \"10月22日\" }, { \"count\": 19, \"data\": \"10月23日\" }, " +
            "{ \"count\": 53, \"data\": \"10月24日\" }, { \"count\": 90, \"data\": \"10月25日\" " +
            "}, { \"count\": 0, \"data\": \"10月26日\" }, { \"count\": 130, \"data\": " +
            "\"10月27日\" }, { \"count\": 233, \"data\": \"10月28日\" }, { \"count\": 40, " +
            "\"data\": \"10月29日\" }, { \"count\": 30, \"data\": \"10月30日\" } ] }, { " +
            "\"organId\": 22, \"organName\": \"北京开发机构\", \"items\": [ { \"count\": 120, " +
            "\"data\": \"10月1日\" }, { \"count\": 12, \"data\": \"10月2日\" }, { \"count\": 10, " +
            "\"data\": \"10月3日\" }, { \"count\": 132, \"data\": \"10月4日\" }, { \"count\": 12," +
            " \"data\": \"10月5日\" }, { \"count\": 12, \"data\": \"10月6日\" }, { \"count\": 20," +
            " \"data\": \"10月7日\" }, { \"count\": 32, \"data\": \"10月8日\" }, { \"count\": 10," +
            " \"data\": \"10月9日\" }, { \"count\": 132, \"data\": \"10月10日\" }, { \"count\": " +
            "44, \"data\": \"10月11日\" }, { \"count\": 63, \"data\": \"10月12日\" }, { " +
            "\"count\": 120, \"data\": \"10月13日\" }, { \"count\": 132, \"data\": \"10月14日\" " +
            "}, { \"count\": 10, \"data\": \"10月15日\" }, { \"count\": 182, \"data\": " +
            "\"10月16日\" }, { \"count\": 1, \"data\": \"10月17日\" }, { \"count\": 103, " +
            "\"data\": \"10月18日\" }, { \"count\": 120, \"data\": \"10月19日\" }, { \"count\": " +
            "132, \"data\": \"10月20日\" }, { \"count\": 130, \"data\": \"10月21日\" }, { " +
            "\"count\": 52, \"data\": \"10月22日\" }, { \"count\": 19, \"data\": \"10月23日\" }, " +
            "{ \"count\": 53, \"data\": \"10月24日\" }, { \"count\": 90, \"data\": \"10月25日\" " +
            "}, { \"count\": 0, \"data\": \"10月26日\" }, { \"count\": 130, \"data\": " +
            "\"10月27日\" }, { \"count\": 2, \"data\": \"10月28日\" }, { \"count\": 0, \"data\": " +
            "\"10月29日\" }, { \"count\": 0, \"data\": \"10月30日\" } ] } ], \"week\": [ { " +
            "\"organId\": 11, \"organName\": \"北京支队\", \"items\": [ { \"count\": 150, " +
            "\"data\": \"2018年第42周\" }, { \"count\": 230, \"data\": \"2018年第43周\" }, { " +
            "\"count\": 130, \"data\": \"2018年第44周\" }, { \"count\": 520, \"data\": " +
            "\"2018年第45周\" } ] }, { \"organId\": 22, \"organName\": \"北京开发机构\", \"items\": [ " +
            "{ \"count\": 81, \"data\": \"2018年第42周\" }, { \"count\": 30, \"data\": " +
            "\"2018年第43周\" }, { \"count\": 234, \"data\": \"2018年第44周\" }, { \"count\": 400, " +
            "\"data\": \"2018年第45周\" } ] } ] } ] }, { \"address\": \"杭州\", \"data\": [ { " +
            "\"hour\": [ { \"organId\": 1, \"organName\": \"杭州支队\", \"items\": [ { \"count\":" +
            " 2, \"data\": \"00:00\" }, { \"count\": 8, \"data\": \"01:00\" }, { \"count\": " +
            "4, \"data\": \"02:00\" }, { \"count\": 5, \"data\": \"03:00\" }, { \"count\": 1," +
            " \"data\": \"04:00\" }, { \"count\": 0, \"data\": \"05:00\" }, { \"count\": 4, " +
            "\"data\": \"06:00\" }, { \"count\": 53, \"data\": \"07:00\" }, { \"count\": 0, " +
            "\"data\": \"08:00\" }, { \"count\": 30, \"data\": \"09:00\" }, { \"count\": 50, " +
            "\"data\": \"10:00\" }, { \"count\": 9, \"data\": \"11:00\" }, { \"count\": 47, " +
            "\"data\": \"12:00\" }, { \"count\": 9, \"data\": \"13:00\" }, { \"count\": 13, " +
            "\"data\": \"14:00\" }, { \"count\": 10, \"data\": \"15:00\" }, { \"count\": 12, " +
            "\"data\": \"16:00\" }, { \"count\": 13, \"data\": \"17:00\" }, { \"count\": 10, " +
            "\"data\": \"18:00\" }, { \"count\": 10, \"data\": \"19:00\" }, { \"count\": 12, " +
            "\"data\": \"20:00\" }, { \"count\": 22, \"data\": \"21:00\" }, { \"count\": 43, " +
            "\"data\": \"22:00\" }, { \"count\": 44, \"data\": \"23:00\" } ] }, { " +
            "\"organId\": 2, \"organName\": \"开发机构\", \"items\": [ { \"count\": 11, \"data\":" +
            " \"00:00\" }, { \"count\": 18, \"data\": \"01:00\" }, { \"count\": 0, \"data\": " +
            "\"02:00\" }, { \"count\": 10, \"data\": \"03:00\" }, { \"count\": 2, \"data\": " +
            "\"04:00\" }, { \"count\": 30, \"data\": \"05:00\" }, { \"count\": 10, \"data\": " +
            "\"06:00\" }, { \"count\": 3, \"data\": \"07:00\" }, { \"count\": 2, \"data\": " +
            "\"08:00\" }, { \"count\": 24, \"data\": \"09:00\" }, { \"count\": 26, \"data\": " +
            "\"10:00\" }, { \"count\": 17, \"data\": \"11:00\" }, { \"count\": 5, \"data\": " +
            "\"12:00\" }, { \"count\": 43, \"data\": \"13:00\" }, { \"count\": 33, \"data\": " +
            "\"14:00\" }, { \"count\": 28, \"data\": \"15:00\" }, { \"count\": 2, \"data\": " +
            "\"16:00\" }, { \"count\": 1, \"data\": \"17:00\" }, { \"count\": 2, \"data\": " +
            "\"18:00\" }, { \"count\": 4, \"data\": \"19:00\" }, { \"count\": 22, \"data\": " +
            "\"20:00\" }, { \"count\": 1, \"data\": \"21:00\" }, { \"count\": 0, \"data\": " +
            "\"22:00\" }, { \"count\": 4, \"data\": \"23:00\" } ] } ], \"day\": [ { " +
            "\"organId\": 1, \"organName\": \"杭州支队\", \"items\": [ { \"count\": 120, " +
            "\"data\": \"10月1日\" }, { \"count\": 12, \"data\": \"10月2日\" }, { \"count\": 10, " +
            "\"data\": \"10月3日\" }, { \"count\": 132, \"data\": \"10月4日\" }, { \"count\": 12," +
            " \"data\": \"10月5日\" }, { \"count\": 12, \"data\": \"10月6日\" }, { \"count\": 20," +
            " \"data\": \"10月7日\" }, { \"count\": 32, \"data\": \"10月8日\" }, { \"count\": 10," +
            " \"data\": \"10月9日\" }, { \"count\": 132, \"data\": \"10月10日\" }, { \"count\": " +
            "44, \"data\": \"10月11日\" }, { \"count\": 63, \"data\": \"10月12日\" }, { " +
            "\"count\": 120, \"data\": \"10月13日\" }, { \"count\": 132, \"data\": \"10月14日\" " +
            "}, { \"count\": 10, \"data\": \"10月15日\" }, { \"count\": 182, \"data\": " +
            "\"10月16日\" }, { \"count\": 1, \"data\": \"10月17日\" }, { \"count\": 103, " +
            "\"data\": \"10月18日\" }, { \"count\": 120, \"data\": \"10月19日\" }, { \"count\": " +
            "132, \"data\": \"10月20日\" }, { \"count\": 130, \"data\": \"10月21日\" }, { " +
            "\"count\": 52, \"data\": \"10月22日\" }, { \"count\": 19, \"data\": \"10月23日\" }, " +
            "{ \"count\": 53, \"data\": \"10月24日\" }, { \"count\": 90, \"data\": \"10月25日\" " +
            "}, { \"count\": 42, \"data\": \"10月26日\" }, { \"count\": 130, \"data\": " +
            "\"10月27日\" }, { \"count\": 2, \"data\": \"10月28日\" }, { \"count\": 0, \"data\": " +
            "\"10月29日\" }, { \"count\": 43, \"data\": \"10月30日\" } ] }, { \"organId\": 2, " +
            "\"organName\": \"开发机构\", \"items\": [ { \"count\": 120, \"data\": \"10月1日\" }, {" +
            " \"count\": 12, \"data\": \"10月2日\" }, { \"count\": 10, \"data\": \"10月3日\" }, {" +
            " \"count\": 132, \"data\": \"10月4日\" }, { \"count\": 12, \"data\": \"10月5日\" }, " +
            "{ \"count\": 12, \"data\": \"10月6日\" }, { \"count\": 20, \"data\": \"10月7日\" }, " +
            "{ \"count\": 32, \"data\": \"10月8日\" }, { \"count\": 10, \"data\": \"10月9日\" }, " +
            "{ \"count\": 132, \"data\": \"10月10日\" }, { \"count\": 44, \"data\": \"10月11日\" " +
            "}, { \"count\": 63, \"data\": \"10月12日\" }, { \"count\": 120, \"data\": " +
            "\"10月13日\" }, { \"count\": 132, \"data\": \"10月14日\" }, { \"count\": 10, " +
            "\"data\": \"10月15日\" }, { \"count\": 182, \"data\": \"10月16日\" }, { \"count\": " +
            "1, \"data\": \"10月17日\" }, { \"count\": 103, \"data\": \"10月18日\" }, { " +
            "\"count\": 120, \"data\": \"10月19日\" }, { \"count\": 132, \"data\": \"10月20日\" " +
            "}, { \"count\": 130, \"data\": \"10月21日\" }, { \"count\": 52, \"data\": " +
            "\"10月22日\" }, { \"count\": 19, \"data\": \"10月23日\" }, { \"count\": 53, " +
            "\"data\": \"10月24日\" }, { \"count\": 90, \"data\": \"10月25日\" }, { \"count\": 0," +
            " \"data\": \"10月26日\" }, { \"count\": 130, \"data\": \"10月27日\" }, { \"count\": " +
            "2, \"data\": \"10月28日\" }, { \"count\": 0, \"data\": \"10月29日\" }, { \"count\": " +
            "0, \"data\": \"10月30日\" } ] } ], \"week\": [ { \"organId\": 1, \"organName\": " +
            "\"杭州支队\", \"items\": [ { \"count\": 120, \"data\": \"2018年第42周\" }, { \"count\":" +
            " 300, \"data\": \"2018年第43周\" }, { \"count\": 30, \"data\": \"2018年第44周\" }, { " +
            "\"count\": 400, \"data\": \"2018年第45周\" } ] }, { \"organId\": 2, \"organName\": " +
            "\"开发机构\", \"items\": [ { \"count\": 120, \"data\": \"2018年第42周\" }, { \"count\":" +
            " 300, \"data\": \"2018年第43周\" }, { \"count\": 30, \"data\": \"2018年第44周\" }, { " +
            "\"count\": 400, \"data\": \"2018年第45周\" } ] } ] } ] } ] } } }";

    public String getJsonChart() {
        return jsonChart;
    }

    public void setJsonChart(String jsonChart) {
        this.jsonChart = jsonChart;
    }
}
